<?php
// +----------------------------------------------------------------------
// | 哈雷光电科技有限公司 [ Thinkphp ]
// +----------------------------------------------------------------------
// | 版本: Thinkphp3.2.2
// +----------------------------------------------------------------------
// | Author: shijinsheng <1031735400@qq.com>
// +----------------------------------------------------------------------

// 应用入口文件

// 检测PHP环境
if(version_compare(PHP_VERSION,'5.3.0','<'))  die('require PHP > 5.3.0 !');

// 开启调试模式 建议开发阶段开启 部署阶段注释或者设为false
define('APP_DEBUG',True);

// 定义应用目录
define('APP_PATH','./Home/');

// 引入ThinkPHP入口文件
require './ThinkPHP/ThinkPHP.php';

// 亲^_^ 后面不需要任何代码了 就是如此简单
